Repository: OPI-PIB/jupyter-edx-grader-xblock
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: pl

source: Notebook Successfully Uploaded
pl: Pomyślnie przesłano notatnik

source: Requirements Successfully Uploaded
pl: Wymagania zostały pomyślnie zmienione

source: An error occurred while uploading.<br><br>Please see the javascript console and/or EdX CMS Logs for more information.
pl: Wystąpił błąd podczas przesyłania<br><br>. Więcej informacji można znaleźć w javascript console lub/i logach edX CMS.

source: Uploading and evaluating iPython Notebook ... Please Wait
pl: Przesyłanie i ewaluacja notatnika Python... Proszę czekać

source: Uploading Requirements and building environment ... Please Wait
pl: Dodawanie wymagań i budowanie środowiska... Proszę czekać

source: Notebook Successfully Uploaded and Scored.
pl: Pomyślnie przesłano i oceniono notatnik.

source: Please note the following error:<br><br>
pl: Zwróć uwagę na następujący błąd: <br><br>

source: Notebook Successfully Uploaded and Scored<br><br>Please see results below
pl: Pomyślnie przesłano i oceniono notatnik <br><br> Zobacz wyniki poniżej

source: An error has occurred while uploading your notebook.<br><br>Please contact your instructor.
pl: Wystąpił błąd podczas przesyłania notatnika<br><br>Skontaktuj się ze swoim prowadzącym.

source: Uploading and evaluating iPython notebook ... Please Wait
pl: Przesyłanie i ocenianie notatnika Python ... Proszę czekać
