Repository: OPI-PIB/jupyter-edx-grader-xblock
Catalog: locale/*/LC_MESSAGES/text.po
Languages: pl

source: No Solution Cells Found in uploaded notebook! Are you sure this is the instructor version?
pl: W przesłanym pliku nie znaleziono części z rozwiązaniem! Czy na pewno jest to wersja instruktorska?

source: No File Attached
pl: Brak załącznika

source: Problem does not support rescoring: %{location}s
pl: Zadanie nie pozwala na ponowne ocenianie: %{location}

source: Cannot rescore unanswered problem: %{location}s
pl: Nie można ponownie ocenić zadania bez odpowiedzi: %{location}

source: Instructor Section
pl: Panel prowadzącego

source: Python Virtual Environment
pl: Wirtualne Środowisko Python

source: Select a requirements.txt file to upload.
pl: Wybierz plik do udostępnienia w rozszerzeniu wymagania.txt

source: Only include packages that are actually imported from within the notebook itself
pl: Uwzględnij tylko pakiety, które faktycznie zostały zaimportowane z notatnika.

source: There is a single Virtual Environment for each course
pl: Dla każdego kursu istnieje jedno Wirtualne Środowisko

source: The uploaded requirements.txt will overwrite the current requirements for this course, so please be sure to include all packages required for this course
pl: Udostępniony plik wymagania.txt zastąpi istniejące wymagania dla tego kursu, więc pamiętaj, aby uwzględnić wszystkie pakiety wymagane dla tego kursu

source: Upload
pl: Prześlij

source: Installed Packages
pl: Zainstalowane pakiety

source: No Packages Specified
pl: Brak wyszczególnionych pakietów

source: Instructor Notebook Upload
pl: Prześlij Notatnik Prowadzącego

source: Select an Instructor Notebook to upload
pl: Wybierz Notatnik Prowadzącego do przesłania

source: WARNING
pl: UWAGA

source: If you re-upload a new notebook after it has already been published to the student you should use a different name for the new notebook (version suffix, date, etc), republish, and notify students they must re-download the updated notebook. Errors will occur for the student if there is a mismatch in cell id's between the uploaded and instructor notebooks
pl: Jeśli ponownie przesyłasz nowy notatnik po tym, jak został on już opublikowany, powinieneś zmienić nazwę notatnika na inną (numer wersji, data itp.), opublikować go jeszcze raz i powiadomić studentów, że muszą ponownie pobrać zaktualizowany notatnik. W przeciwnym razie, studentom pojawią się błędy wynikające z niedopasowania w identyfikatorze komórki pomiędzy starymi a nowymi notatnikami prowadzącego

source: Uploaded Notebook Details
pl: Szczegóły udostępnionego Notatnika

source: Notebook Link
pl: Link do Notatnika

source: Download
pl: Pobierz

source: No Notebook Uploaded
pl: Nie udostępniono Notatnika

source: Notebook Name
pl: Nazwa Notatnika

source: Max Possible Score
pl: Maksymalny wynik możliwy do uzyskania

source: Uploaded At
pl: Przesłano o

source: Instructions
pl: Instrukcje

source: Download Student Notebook
pl: Pobierz Notatnik Studenta

source: Student Upload
pl: Plik studenta

source: Results
pl: Wyniki

source: Attempts
pl: Podejścia

source: Unlimited
pl: Nieograniczone

source: Last Submitted
pl: Ostatnio przesłane

source: Autograded Notebook
pl: Automatycznie oceniany Notatnik

source: Total Score
pl: Łączny wynik

source: Section Scores
pl: Moduł z wynikami

source: Cell Name
pl: Nazwa komórki

source: Display Name
pl: Wyświetlana nazwa

source: Graded Jupyter Notebook
pl: Klasyfikowany Notatnik Jupyter

source: Name of this XBlock
pl: Nazwa tego XBlocka

source: Instructions displayed to Student
pl: Instrukcje wyświetlane studentowi

source: Student Instructions
pl: Instrukcje dla studenta

source: Max number of allowed submissions (0 = unlimited)
pl: Maksymalna liczba możliwych podejść (0 = nieograniczona)

source: Allowed Submissions
pl: Dozwolone podejścia

source: Max seconds to wait for each cell to execute
pl: Maksymalna ilość sekund, którą należy odczekać na wykonanie danej komórki

source: Cell Timeout (s)
pl: Limit czasowy komórki (s)

source: Max allowable file size of student uploaded file (Bytes)
pl: Maksymalny dopuszczalny rozmiar pliku przesłanego przez studenta (bajty)

source: Max File Size (B)
pl: Maksymalny rozmiar pliku (bajty)

source: If True, allows network access from student notebook
pl: Jeśli True, umożliwia dostęp do sieci z notatnika studenta

source: Network Allowed
pl: Użycie sieci dozwolone

source: If True, allows student to download .html version of their autograded notebook
pl: Jeśli True, umożliwia pobranie automatycznie ocenionego notatnika w wersji .html

source: Allow Graded NB Download
pl: Pozwól na pobranie ocenionego notatnika

source: filename of the notebook
pl: Nazwa notatnika

source: UTC datetime the notebook was uploaded
pl: Data i czas UTC kiedy notatnik został przesłany

source: Max possible score attainable
pl: Maksymalny wynik możliwy do uzyskania

source: Number of times student has submitted problem
pl: Liczba podejść studenta do zadania

source: Student Score
pl: Wynik studenta

source: Student Scores per section
pl: Wynik studenta z podziałem na sekcje

source: UTC datetime student last submitted notebook
pl: Data i czas UTC kiedy student przesłał najnowszy notatnik

source: Not Yet Submitted
pl: Jeszcze nie przesłano

source: File (%(file_size)i B) exceeds max allowed file size of %(max_file_size)i B
pl: Plik (%(file_size)i B) przekracza maksymalny dozwolony rozmiar pliku: %(max_file_size)i B

source: Maximum allowed attempts reached
pl: Osiągnięto maksymalną dozwoloną liczbę podejść

source: File extension must be .ipynb, not %(filename)s
pl: Plik musi kończyć się rozszerzeniem .ipynb, nie %(filename)s

source: Uploaded notebook (%(filename)s) must be named: %(nb_name)s)
pl: Przesłany notatnik (%(filename)s) musi mieć nazwę: %(nb_name)s)

source: Unable to submit past due date: %(due)s
pl: Nie można przesłać po dacie: %(due)s

source: File extension must be .ipynb, not %(filename)
pl: Plik musi kończyć się rozszerzeniem .ipynb, nie %(filename)
